ACTIONS = {'останов': 'stop', 'прекрат': 'stop', 'стоп': 'stop', 'пауза': 'stop', 'возобнов': 'resume', 'снова': 'resume', 'запуск': 'resume', 'запуст': 'resume', 'удал': 'delete', 'убер': 'delete', 'убр': 'delete', 'закрой': 'delete', 'созд': 'change', 'создав': 'change', 'напомин': 'change', 'напомн': 'change', 'отметиться': 'change', 'список': 'show', 'покаж': 'show', 'напоминания': 'show', 'вывед': 'show'}
ACTION_ENDS = ['aвать', 'ать', 'ить', 'yть', 'ять', 'авай', 'ай', 'ляй', 'яй', 'и']

TENS = {'двадцать': 20, 'тридцать': 30}
TEENS = {'десять': 10, 'одиннадцать': 11, 'двенадцать': 12, 'полдень': 12, 'тринадцать': 13, 'четырнадцать': 14, 'пятнадцать': 15, 'шестнадцать': 16, 'семнадцать': 17, 'восемнадцать': 18, 'девятнадцать': 19}
DIGITS = {'ноль': 0, 'нуль': 0, 'один': 1, 'два': 2, 'три': 3, 'четыре': 4, 'пять': 5, 'шесть': 6, 'семь': 7, 'восемь': 8, 'девять': 9}
NOT = ['не', 'прекрати', 'остановись', 'хватит', 'задолбал']
VOIDS = ['в', 'во', 'по', 'и', 'каждую', 'каждый', 'каждое', 'напоминание', 'год', 'месяц', 'день', 'ежегодно', 'ежемесячно', 'ежедневно']

WEEKDAY = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']
WEEKDAYS = ['понедельник', 'вторник', 'сред', 'четверг', 'пятниц', 'суббот', 'воскресень']
WEEKDAY_ENDS = ['ам', 'а', 'е', 'ям', 'у']

MONTH = ['янв', 'фев', 'мар', 'апр', 'май', 'июн', 'июл', 'авг', 'сен', 'окт', 'ноя', 'дек']
MONTHS = ['январ', 'феврал', 'март', 'апрел', 'ма', 'июн', 'июл', 'август', 'сентябр', 'октябр', 'ноябр', 'декабр']
MONTH_ENDS = ['ь', 'я', 'а', 'й', 'у', 'е', 'ю']

MENTION = '@memotriggersbot'
